#include <iostream>
#include <math.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "RUS");
	//cout<<"\t\t\t\t\t_________Первое задание_________"<<endl;
	int x1, x2, y1, y2,x3,y3;
	float c,d1,d2;
	/*cout << "Введите первую координату точки через пробел:" << endl;
	cin >> x1>> y1;
	cout << "Введите вторую координату точки через пробел:" << endl;
	cin >> x2>> y2;
	c = sqrt(abs((x1 - x2) * (x1 - x2) + (y1 - y2) * (y1 - y2)));
	cout << "Расстояние между двумя заданными вами точками равно:"<< c << endl;
	*/

	/*cout << "\t\t\t\t\t_________второе задание_________" << endl;
	cout << "Введите   точку A:" << endl;
	cin >> x1;
	cout << "Введите   точку B:" << endl;
	cin >> x2;
	cout << "Введите   точку C:" << endl;
	cin >> x3;
	if ((x1 > 0) && (x3 > 0))
		d1 = abs((x1)-(x3));
	if ((x1 < 0) && (x3 < 0))
		d1 = abs(x1 - x3);
	if ((x1 == 0) || (x3 == 0))
		d1 = abs(x1 + x3);
	if ((x1 < 0) || (x3 < 0))
		d1 = abs(x1 + x3);
	if ((x1 == 0) && (x3 == 0))
		d1 = 0;
	
	if ((x2 > 0) && (x3 > 0))
		d2 = abs((x2)-(x3));
	if ((x2 < 0) && (x3 < 0))
		d2 = abs(x2 - x3);
	if ((x2 == 0) || (x3 == 0))
		d2 = abs(x2 + x3);
	if ((x2 < 0) || (x3 < 0))
		d2 = abs(x2 + x3);
	if ((x2 == 0) && (x3 == 0))
		d2 = 0;
	c = d1 + d2;
	cout << "Длина отрезка AC равна: " << d1 << ". Длина отрезка BC равна: " << d2 << endl;
	cout << "Сумма длинн отрезков AC и BС равна: " << c << endl;
	*/
	
	cout << "\t\t\t\t\t_________третье задание_________" << endl;
	cout << "Введите   точку A:" << endl;
	cin >> x1;
	cout << "Введите   точку B:" << endl;
	cin >> x3;
	cout << "Введите   точку C,так что бы она находилась между точками A и B:" << endl;
	cin >> x2;
	if ((x1 > 0) && (x2 > 0))
		d1 = abs((x1)-(x2));
	if ((x1 < 0) || (x2 < 0))
		d1 = abs(x1) + abs(x2);
	if ((x1 < 0) && (x2 < 0))
		d1 = abs((x2)-(x1));
	if ((x1 == 0) || (x2 == 0))
		d1 = abs(x2 + x1);
	if ((x1 == 0) && (x2 == 0))
		d1 = 0;
 
	 if ((x2 > 0) && (x3 > 0))
		d2 = abs((x2)-(x3));
	 if ((x2<0) ||(x3<0))
		d2 = abs(x2) + abs(x3);
     if ((x2 < 0) && (x3 < 0))
		d2 = abs((x2)-(x3));
	 if ((x2==0)||(x3==0))
		 d2 = abs(x2+x3);
	 if ((x2 == 0) && (x3 == 0))
		 d2 = 0;
	c = d1 * d2;
	cout << "Произведение отрезков AC и BС равна: " << c << endl;

	cout << "\t\t\t\t\t_________четвертое задание_________" << endl;

	return 0;
}